In [34]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [35]:
df = pd.read_csv('train_ctrUa4K.csv')
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [36]:
df.drop('Loan_ID', axis = 1, inplace = True)
df.shape

(614, 12)

In [37]:
df.dropna(subset = ['Credit_History'], inplace = True )

In [38]:


df.dtypes

Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [39]:
df['Gender'].value_counts().to_frame()

        Gender
Male       451
Female     101

In [40]:
df['Married'].value_counts().to_frame()

     Married
Yes      362
No       199

In [41]:
df['Dependents'].value_counts().to_frame()

    Dependents
0          316
2           95
1           90
3+          48

In [42]:
df['Education'].value_counts().to_frame()

              Education
Graduate            443
Not Graduate        121

In [43]:
df['Self_Employed'].value_counts().to_frame()

     Self_Employed
No             463
Yes             75

In [44]:

df['Property_Area'].value_counts().to_frame()

           Property_Area
Semiurban            217
Urban                182
Rural                165

In [45]:
#df.Loan_Status.replace(('Y', 'N'), (1, 0), inplace=True)
df.Property_Area.replace(('Urban', 'Rural'), (1,0), inplace = True)
df.Self_Employed.replace(('Yes', 'No'), (1, 0), inplace=True)
df.Education.replace(('Graduate', 'Not Graduate'), (1, 0), inplace=True)
df.Married.replace(('Yes', 'No'), (1, 0), inplace=True)

In [46]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,0.0,0,1,0.0,5849,0.0,NaN,360.0,1.0,1,Y
1,Male,1.0,1,1,0.0,4583,1508.0,128.0,360.0,1.0,0,N
2,Male,1.0,0,1,1.0,3000,0.0,66.0,360.0,1.0,1,Y
3,Male,1.0,0,0,0.0,2583,2358.0,120.0,360.0,1.0,1,Y
4,Male,0.0,0,1,0.0,6000,0.0,141.0,360.0,1.0,1,Y

In [47]:
df.dtypes

Gender                object
Married              float64
Dependents            object
Education              int64
Self_Employed        float64
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [48]:
df.describe()

,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,561.000000,564.000000,538.000000,564.000000,564.000000,543.000000,550.000000,564.000000
mean,0.645276,0.785461,0.139405,5466.436170,1530.448440,145.088398,342.152727,0.842199
std,0.478856,0.410867,0.346691,6271.344106,2471.721359,83.309428,64.586272,0.364878
min,0.000000,0.000000,0.000000,150.000000,0.000000,9.000000,36.000000,0.000000
25%,0.000000,1.000000,0.000000,2892.750000,0.000000,100.000000,360.000000,1.000000
50%,1.000000,1.000000,0.000000,3815.000000,1105.500000,127.000000,360.000000,1.000000
75%,1.000000,1.000000,0.000000,5803.750000,2250.000000,165.500000,360.000000,1.000000
max,1.000000,1.000000,1.000000,81000.000000,33837.000000,700.000000,480.000000,1.000000

In [49]:
df.corr()

,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
Married,1.000000,-0.008348,0.025009,0.057535,0.122216,0.172478,-0.107796,0.004381
Education,-0.008348,1.000000,0.013504,0.142372,0.054520,0.171681,0.092262,0.081822
Self_Employed,0.025009,0.013504,1.000000,0.143969,-0.000616,0.110508,-0.038249,0.003883
ApplicantIncome,0.057535,0.142372,0.143969,1.000000,-0.126174,0.570292,-0.060362,-0.014715
CoapplicantIncome,0.122216,0.054520,-0.000616,-0.126174,1.000000,0.158757,-0.001542,-0.002056
LoanAmount,0.172478,0.171681,0.110508,0.570292,0.158757,1.000000,0.023239,-0.008433
Loan_Amount_Term,-0.107796,0.092262,-0.038249,-0.060362,-0.001542,0.023239,1.000000,0.001470
Credit_History,0.004381,0.081822,0.003883,-0.014715,-0.002056,-0.008433,0.001470,1.000000

In [50]:
y_data = df.Loan_Status
df.drop('Loan_Status', axis = 1, inplace = True)
x_data = df

In [51]:
from sklearn.model_selection import train_test_split

In [52]:
x_train, x_test, y_train, y_test = train_test_split(x_data, y_data, test_size = 0.20, random_state = 1)

print(x_test.shape[0], y_test.shape[0])
print(x_train.shape[0], y_train.shape[0])

113 113
451 451

In [53]:
from sklearn.linear_model import LogisticRegression

In [54]:
lr = LogisticRegression()

In [55]:
x2 = x_train['Credit_History'].fillna(x_train['Credit_History'].mode)

In [60]:
lr.fit(x_train[['Credit_History']], y_train)

C:\Users\Shashank Dwivedi\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [62]:
lr.score(x_test[['Credit_History']], y_test)

0.8230088495575221

In [63]:
df2 = pd.read_csv("test_lAUu6dG.csv")
df2.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [64]:
df2['Credit_History'] = df2['Credit_History'].fillna(df2['Credit_History'].mode()[0])

In [65]:
df2['Credit_History'].value_counts()

1.0    308
0.0     59
Name: Credit_History, dtype: int64

In [66]:
df2.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,367.000000,367.000000,362.000000,361.000000,367.000000
mean,4805.599455,1569.577657,136.132597,342.537396,0.839237
std,4910.685399,2334.232099,61.366652,65.156643,0.367814
min,0.000000,0.000000,28.000000,6.000000,0.000000
25%,2864.000000,0.000000,100.250000,360.000000,1.000000
50%,3786.000000,1025.000000,125.000000,360.000000,1.000000
75%,5060.000000,2430.500000,158.000000,360.000000,1.000000
max,72529.000000,24000.000000,550.000000,480.000000,1.000000

In [71]:
yhat = lr.predict(df2[['Credit_History']])
yhat[0:50]

array(['Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'N', 'Y', 'Y', 'Y', 'Y', 'Y',
       'N', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'N',
       'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'N', 'Y', 'Y', 'Y',
       'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y'],
      dtype=object)

In [102]:
sr1 = pd.Series(yhat,name = 'Loan_Status')
sr2 = pd.Series(df2['Loan_ID'], name = 'Loan_ID')

In [104]:
predict = pd.concat([sr2, sr1], axis = 1)

In [105]:
predict.head()

    Loan_ID Loan_Status
0  LP001015           Y
1  LP001022           Y
2  LP001031           Y
3  LP001035           Y
4  LP001051           Y

In [130]:
predict.to_csv('predictions.csv',index= False)

In [131]:
predict.head()

    Loan_ID Loan_Status
0  LP001015           Y
1  LP001022           Y
2  LP001031           Y
3  LP001035           Y
4  LP001051           Y

In [132]:
predict.shape

(367, 2)